src/cfe/osn/Catalogs/Партнеры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Партнеры</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОсновнойМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ГруппаДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаПартнеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/osn/CommonModules/ПартнерыИКонтрагенты/Ext/Module.bsl
&ИзменениеИКонтроль("ТекстЗапросаДинамическогоСпискаПартнеры")
Функция Кт_ТекстЗапросаДинамическогоСпискаПартнеры(ЗапросСИнформациейПоКонтрагенту)

	Если ПолучитьФункциональнуюОпцию("ИспользоватьПартнеровКакКонтрагентов") Тогда

		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Контрагенты.Ссылка) КАК Ссылка,
		|	Контрагенты.Партнер КАК Партнер
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|
		|СГРУППИРОВАТЬ ПО
		|	Контрагенты.Партнер
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Контрагенты.Ссылка) > 1";

		УстановитьПривилегированныйРежим(Истина);

		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			ЗапросСИнформациейПоКонтрагенту = Истина;
		КонецЕсли;

	КонецЕсли;

	Если ЗапросСИнформациейПоКонтрагенту Тогда
		ТекстЗапроса = ПартнерыИКонтрагентыЛокализация.ТекстЗапросаДинамическогоСпискаПартнерыСИнформациейПоКонтрагенту();
		Если ПустаяСтрока(ТекстЗапроса) Тогда
			ТекстЗапроса = "
			|ВЫБРАТЬ
			|	СправочникПартнеры.Ссылка,
			|	СправочникПартнеры.ПометкаУдаления,
			|	СправочникПартнеры.Предопределенный,
			|	СправочникПартнеры.Родитель,
			|	СправочникПартнеры.Код,
			|	СправочникПартнеры.Наименование,
			|	СправочникПартнеры.БизнесРегион,
			|	СправочникПартнеры.ГруппаДоступа,
			|	СправочникПартнеры.ДатаРегистрации,
			|	СправочникПартнеры.Клиент,
			|	СправочникПартнеры.Комментарий,
			|	СправочникПартнеры.Конкурент,
			|	СправочникПартнеры.НаименованиеПолное,
			|	СправочникПартнеры.ОсновнойМенеджер,
			|	СправочникПартнеры.Поставщик,
			|	СправочникПартнеры.Перевозчик,
			|	СправочникПартнеры.ПрочиеОтношения,
			|	СправочникПартнеры.ДополнительныеРеквизиты.(
			|		Ссылка,
			|		НомерСтроки,
			|		Свойство,
			|		Значение,
			|		ТекстоваяСтрока
			|	),
			|	СправочникПартнеры.КонтактнаяИнформация.(
			|		Ссылка,
			|		НомерСтроки,
			|		Тип,
			|		Вид,
			|		Представление,
			|		ЗначенияПолей,
			|		Страна,
			|		Регион,
			|		Город,
			|		АдресЭП,
			|		ДоменноеИмяСервера,
			|		НомерТелефона,
			|		НомерТелефонаБезКодов
			|	),
			|	ЕСТЬNULL(Контрагенты.Ссылка, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Контрагент,
			|	ЕСТЬNULL(Контрагенты.ЮрФизЛицо, ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ПустаяСсылка)) КАК ЮрФизЛицо,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(Контрагенты.ОбособленноеПодразделение, ЛОЖЬ)
			|			ТОГДА Контрагенты.ГоловнойКонтрагент
			|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
			|	КОНЕЦ КАК ГоловнойКонтрагент,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(Контрагенты.ОбособленноеПодразделение, ЛОЖЬ)
			|			ТОГДА &ПредставлениеОбособленногоПодразделения
			|		ИНАЧЕ ЕСТЬNULL(ПРЕДСТАВЛЕНИЕ(Контрагенты.ЮрФизЛицо), """")
			|	КОНЕЦ КАК ВидКонтрагента,
			|	ЕСТЬNULL(Контрагенты.ОбособленноеПодразделение, ЛОЖЬ) КАК ОбособленноеПодразделение
			|ИЗ
			|	Справочник.Партнеры КАК СправочникПартнеры
			|		{ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
			|		ПО (Контрагенты.Партнер = СправочникПартнеры.Ссылка)}
			|ГДЕ
			|	ВЫБОР
			|		КОГДА &ОтборПоСегментуУстановлен <> ИСТИНА
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ СправочникПартнеры.Ссылка В (&ОтборПоСегменту)
			|		КОНЕЦ
			|	И ВЫБОР
			|			КОГДА НЕ &ОтборПоПолнотекстовомуПоискуУстановлен
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ СправочникПартнеры.Ссылка В (&ОтборПоПолнотекстовомуПоиску)
			|		КОНЕЦ";
		КонецЕсли;

		Возврат ТекстЗапроса
	Иначе

		Возврат "
		|ВЫБРАТЬ
		|	СправочникПартнеры.Ссылка,
		|	СправочникПартнеры.ПометкаУдаления,
		|	СправочникПартнеры.Предопределенный,
		|	СправочникПартнеры.Родитель,
		|	СправочникПартнеры.Код,
		|	СправочникПартнеры.Наименование,
		|	СправочникПартнеры.БизнесРегион,
		|	СправочникПартнеры.ГруппаДоступа,
		|	СправочникПартнеры.ДатаРегистрации,
		|	СправочникПартнеры.Клиент,
		|	СправочникПартнеры.Комментарий,
		|	СправочникПартнеры.Конкурент,
		|	СправочникПартнеры.НаименованиеПолное,
		|	СправочникПартнеры.ОсновнойМенеджер,
		|	СправочникПартнеры.Поставщик,
		|	СправочникПартнеры.Перевозчик,
		|	СправочникПартнеры.ПрочиеОтношения,
		|	СправочникПартнеры.ОбслуживаетсяТорговымиПредставителями,
		#Вставка
		|	Контрагенты.ИНН КАК ИНН,
		#КонецВставки
		|	СправочникПартнеры.ДополнительныеРеквизиты.(
		|		Ссылка КАК Ссылка1,
		|		НомерСтроки,
		|		Свойство,
		|		Значение
		|	),
		|	СправочникПартнеры.КонтактнаяИнформация.(
		|		Ссылка КАК Ссылка2,
		|		НомерСтроки КАК НомерСтроки1,
		|		Тип,
		|		Вид,
		|		Представление,
		|		ЗначенияПолей,
		|		Страна,
		|		Регион,
		|		Город,
		|		АдресЭП,
		|		ДоменноеИмяСервера,
		|		НомерТелефона,
		|		НомерТелефонаБезКодов
		|	)
		|ИЗ
		|	Справочник.Партнеры КАК СправочникПартнеры
		#Вставка
		|		{ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
		|		ПО (Контрагенты.Партнер = СправочникПартнеры.Ссылка)}
		#КонецВставки
		|ГДЕ
		|	ВЫБОР
		|		КОГДА &ОтборПоСегментуУстановлен <> ИСТИНА
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ СправочникПартнеры.Ссылка В (&ОтборПоСегменту)
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА НЕ &ОтборПоПолнотекстовомуПоискуУстановлен
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ СправочникПартнеры.Ссылка В (&ОтборПоПолнотекстовомуПоиску)
		|		КОНЕЦ";

	КонецЕсли;


КонецФункции
